## Bonus

Notebook to do analysis using SQLAlchemy and Pandas on employees salaries

In [1]:
# Import neccessary libraries
import sqlalchemy as db
import pandas as pd
import sqlparse

# Get my database information
from config import db_name, db_user, db_password, db_schema

In [2]:
# Connect to the database
connect_string = f"postgresql://{db_user}:{db_password}@localhost:5432/{db_name}"
engine = db.create_engine(connect_string)
connection = engine.connect()

# Grab the metadata
metadata = db.MetaData()

# Get the db tables in the correct schema
employees = db.Table('employees', metadata, schema=db_schema, autoload=True, autoload_with=engine)
salaries = db.Table('salaries', metadata, schema=db_schema, autoload=True, autoload_with=engine)
titles = db.Table('titles', metadata, schema=db_schema, autoload=True, autoload_with=engine)

# Form the query with the joins
query = db.select([employees, salaries, titles])
query = query.select_from(
    db.join(
        db.join(employees, salaries, employees.columns.emp_no == salaries.columns.emp_no), 
            titles, employees.columns.emp_title_id == titles.columns.title_id)
) 

# pretty print the SQL for reference
print(sqlparse.format(str(query), reindent=True, keyword_case='upper'))

# Execute the query
results = connection.execute(query).fetchall()

# Populate the dataframe
df = pd.DataFrame(results)

# Get the column names
df.columns = results[0].keys()

df.head(5)

SELECT employee.employees.emp_no,
       employee.employees.emp_title_id,
       employee.employees.birth_date,
       employee.employees.first_name,
       employee.employees.last_name,
       employee.employees.sex,
       employee.employees.hire_date,
       employee.salaries.emp_no,
       employee.salaries.salary,
       employee.titles.title_id,
       employee.titles.title
FROM employee.employees
JOIN employee.salaries ON employee.employees.emp_no = employee.salaries.emp_no
JOIN employee.titles ON employee.employees.emp_title_id = employee.titles.title_id

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,emp_no,salary,title_id,title
0,10005,s0001,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,10005,78228,s0001,Staff
1,10010,e0002,1963-06-01,Duangkaew,Piveteau,F,1989-08-24,10010,72488,e0002,Engineer
2,10011,s0001,1953-11-07,Mary,Sluis,F,1990-01-22,10011,42365,s0001,Staff
3,10013,s0002,1963-06-07,Eberhardt,Terkki,M,1985-10-20,10013,40000,s0002,Senior Staff
4,10017,s0001,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,10017,71380,s0001,Staff

In [3]:
# Check the types for later analysis
df.dtypes

emp_no           int64
emp_title_id    object
birth_date      object
first_name      object
last_name       object
sex             object
hire_date       object
emp_no           int64
salary           int64
title_id        object
title           object
dtype: object

In [4]:
# Make sure employee counts seem accurate
len(df)

300024

In [5]:
# Drop redundant columns from the df (used integer because we have columns with the same name)
df = df.iloc[:,[2,3,4,5,6,7,9,10]]
df.head()

,birth_date,first_name,last_name,sex,hire_date,emp_no,title_id,title
0,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,10005,s0001,Staff
1,1963-06-01,Duangkaew,Piveteau,F,1989-08-24,10010,e0002,Engineer
2,1953-11-07,Mary,Sluis,F,1990-01-22,10011,s0001,Staff
3,1963-06-07,Eberhardt,Terkki,M,1985-10-20,10013,s0002,Senior Staff
4,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,10017,s0001,Staff